Examinator/src/InformationRegisters/ДанныеФайлыСУЗ/ДанныеФайлыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеФайлыСУЗ</name>
  <resources>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>CatalogRef.ФайлыСУЗПрисоединенныеФайлы</types>
    </type>
  </resources>
  <resources>
    <name>ТекстовыеДанные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДвоичныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОбмена</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеФайлыСУЗ/RecordSetModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

// Процедура удаляет данные версии объекта СУЗ из набора данных записи.
//
Процедура УдалитьВерсиюИзНабора(Поставщик, Версия) Экспорт
	
	а = ЭтотОбъект.Количество()-1;
	Пока а>=0 Цикл
		Строка = ЭтотОбъект.Получить(а);
		Если Строка.Версия = Версия И Строка.Поставщик = Поставщик Тогда
			
			
			Если ЗначениеЗаполнено(Строка.ПрисоединенныйФайл) Тогда
				ПрисоединенныйФайлОбъект = Строка.ПрисоединенныйФайл.ПолучитьОбъект();
				ПрисоединенныйФайлОбъект.УстановитьПометкуУдаления(Истина, Истина);
			КонецЕсли;
			
			
			ЭтотОбъект.Удалить(Строка);
		КонецЕсли;
		а = а - 1;
	КонецЦикла;	
	
КонецПроцедуры


Процедура ПриОтправкеНабора() Экспорт
	
	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
	
		Если ЗначениеЗаполнено(ЗаписьНабора.ПрисоединенныйФайл) Тогда
			
			ЗаписьНабора.ДвоичныеДанные = Новый ХранилищеЗначения(ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ЗаписьНабора.ПрисоединенныйФайл));
			
			ЗаписьНабора.ДанныеОбмена = Новый ХранилищеЗначения(
				Новый ФиксированнаяСтруктура(ПрисоединенныеФайлы.ПолучитьДанныеФайла(ЗаписьНабора.ПрисоединенныйФайл,,Ложь,Ложь))
			);
			
		КонецЕсли;		
	
	КонецЦикла;	
	
	
КонецПроцедуры

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		
		Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
			
			ДанныеОбмена = ЗаписьНабора.ДанныеОбмена.Получить();
			ДвоичныеДанныеЗаписи = ЗаписьНабора.ДвоичныеДанные.Получить();
			
			Если ДанныеОбмена <> Неопределено
				И ДвоичныеДанныеЗаписи <> Неопределено Тогда
				
				Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ЗаписьНабора.ПрисоединенныйФайл) Тогда
					
					ПрисоединенныеФайлы.ОбновитьПрисоединенныйФайл(ЗаписьНабора.ПрисоединенныйФайл,
					     Новый Структура("АдресФайлаВоВременномХранилище, АдресВременногоХранилищаТекста, ИмяБезРасширения, ДатаМодификацииУниверсальная, Расширение",
							ПоместитьВоВременноеХранилище(ДвоичныеДанныеЗаписи),
							"",
							ДанныеОбмена.Наименование,
							ДанныеОбмена.ДатаМодификацииУниверсальная,
							ДанныеОбмена.Расширение
						)
					 );					 
					
				Иначе
					
					ПрисоединенныеФайлы.ДобавитьФайл(ЗаписьНабора.СсылкаНаОбъектСУЗ, ДанныеОбмена.Наименование, ДанныеОбмена.Расширение, ДанныеОбмена.ДатаМодификацииУниверсальная, ДанныеОбмена.ДатаМодификацииУниверсальная, ПоместитьВоВременноеХранилище(ДвоичныеДанныеЗаписи),,,ЗаписьНабора.ПрисоединенныйФайл);					
										
				КонецЕсли;
					
				ЗаписьНабора.ДвоичныеДанные = Неопределено;
				ЗаписьНабора.ДанныеОбмена = Неопределено;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

#КонецЕсли
